#include <iostream>
#include <string>
int AbsoluteValue(int number);
int DigitCount(int number);
float PerimeterByCoordinates(int x1, int y1, int x2, int y2, int x3, int y3);
int Concat(int number1, int number2);

int main()
{
	int x1, y1;
	std::cin >> x1 >> y1;
	std::cout << Concat(x1, y1);
}

// Задача 1: Напишете функция, която приема цяло число и връща модула му.
int AbsoluteValue(int number) {
	return (number < 0) ? -number : number;
}

// Задача 2 : Напишете функция, която приема цяло число и връща броя на цифрите му.
int DigitCount(int number) {
	int count = 0;
	for (int i = number; i > 0; i /= 10, count++);
	return count;
}
// Задача 3 : Напишете функция, която приема 6 целочислени координати(3 точки) 
// и връща обиколката на триъгълника по тези точки. √[(x2 − x1)^2 + (y2 − y1)^2]
float PerimeterByCoordinates(int x1, int y1, int x2, int y2, int x3, int y3) {
	float a = sqrt(pow((x2 - x1), 2) + pow((y2 - y1), 2));
	float b = sqrt(pow((x2 - x3), 2) + pow((y2 - y3), 2));
	float c = sqrt(pow((x3 - x1), 2) + pow((y3 - y1), 2));

	return a + b + c;
}

// Задача 4 : Да се напише функция, която приема две естествени числа и връща ново число, 
// което е тяхната конкатенация.
int Concat(int number1, int number2) {
	return std::stoi(std::to_string(number1) + std::to_string(number2));
}


// Задача 5 : Напишете функция, която дадено по подадено естествено число N, връща число, 
// което е резултат от конкатенацията на обърнатото число на N с подаденото N.

// Задача 6 : Да се напише функция, която приема три естествени числа a и b и k и 
// връща броя на числата в интервата[a...b], които имат точно k различни прости делитела.

// Задача 7 : Напишете функция, която приема естествено число и връща дали цифрите му 
// са сортирани(във възходящ или в низходящ ред).

// Задача 8 : Напишете функция, която приема естествено число и връща дали цифрите му са еднакви.

// Задача 9 : Напишете функция, която приема естествено число и връща ново число, 
// което има същите цифри, но в сортиран вид.

// Задача 10 : Напишете функция, която приема символ и дали символа е главна буква.

// Задача 11 : Напишете функция, която приема символ и връща съответната главна буква
// (ако подадения символ е малък символ).

// Задача 12 : Напишете функция, която приема символ и ако символът е цифра, 
// да върне съответната цифра. Ако символът не е цифра, то да върне - 1

